# SetBorderAroundSchedule Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..SetBorderAroundSchedule Method
PanelScheduleData Class See Also
---
Adds a border around the schedule
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetBorderAroundSchedule(
	ElementId borderId
)
```

Visual Basic
---
```text
Public Sub SetBorderAroundSchedule ( _
	borderId As ElementId _
)
```

Visual C++
---
```text
public:
void SetBorderAroundSchedule(
	ElementId^ borderId
)
```

# ### Parameters
borderId
    Type: Autodesk.Revit.DB..::..ElementId The border to set around the schedule
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace